---

# 3. Pandas

Pandas is the best known Python library for manipulating and analyzing data. It is built on top of NumPy, so many features are similar. We will use Pandas to work with structured datasets.

Just as NumPy provides us with arrays and with them we access many new features, Pandas provides us with DataFrames and Series. By far the most used object is the first one, DataFrames.

We are going to use the open data of the Argentine government, so you will have to download the csv from the following link: [Names 2010-2014](https://www.datos.gob.ar/dataset/otros-nombres-personas-fisicas)

In [ ]:
import pandas as pd

## Reading a csv file

In [ ]:
df_names = pd.read_csv("https://raw.githubusercontent.com/agusle/something_new_everyday/master/intensive_training/data/nombres-2010-2014.csv")
df_names

                        nombre  cantidad  anio
0                     Benjamin      2986  2010
1                        Sofia      2252  2010
2                     Bautista      2176  2010
3                      Joaquín      2111  2010
4                 Juan Ignacio      2039  2010
...                        ...       ...   ...
871489            Leire Jasmin         1  2014
871490  Isaias Sebastian Ariel         1  2014
871491        Yanira Valentina         1  2014
871492            Angie Ainara         1  2014
871493          Elias Hernando         1  2014

[871494 rows x 3 columns]

## Columns renaming

First of all let's rename the columns to name, amount and year

In [ ]:
df_names = df_names.rename(columns={'nombre': 'name', 'cantidad': 'amount', 'anio': 'year'})
df_names

                          name  amount  year
0                     Benjamin    2986  2010
1                        Sofia    2252  2010
2                     Bautista    2176  2010
3                      Joaquín    2111  2010
4                 Juan Ignacio    2039  2010
...                        ...     ...   ...
871489            Leire Jasmin       1  2014
871490  Isaias Sebastian Ariel       1  2014
871491        Yanira Valentina       1  2014
871492            Angie Ainara       1  2014
871493          Elias Hernando       1  2014

[871494 rows x 3 columns]

## Some Pandas useful functions

**TODO:** Investigate the functions that are implemented in the next cell. What do they do? What do you think they can be useful for?

In [ ]:
df_names.head()

           name  amount  year
0      Benjamin    2986  2010
1         Sofia    2252  2010
2      Bautista    2176  2010
3       Joaquín    2111  2010
4  Juan Ignacio    2039  2010

In [ ]:
df_names.tail()

                          name  amount  year
871489            Leire Jasmin       1  2014
871490  Isaias Sebastian Ariel       1  2014
871491        Yanira Valentina       1  2014
871492            Angie Ainara       1  2014
871493          Elias Hernando       1  2014

In [ ]:
df_names.count()

name      871494
amount    871494
year      871494
dtype: int64

In [ ]:
df_names.shape

(871494, 3)

In [ ]:
df_names.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 871494 entries, 0 to 871493
Data columns (total 3 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   name    871494 non-null  object
 1   amount  871494 non-null  int64
 2   year    871494 non-null  int64
dtypes: int64(2), object(1)
memory usage: 19.9+ MB

In [ ]:
df_names.sample(10)

                            name  amount  year
554365       Yazmin Selene Iriel       1  2013
646918           Alejandro Pedro       1  2013
290829             Camilo Samuel       3  2012
562775               Cielo Aleli       1  2013
559520                Yenhy Maya       1  2013
199418  Oriana Valentina Mariana       1  2011
692299                      Nila       4  2014
101663             Emanuel Adair       1  2010
431199             Nadia Micaela       1  2012
208449        Alhue Ana Estrella       1  2011

## Append a new row

**TODO:** Suppose that in the data load, someone forgot to add a name and its respective amount and year.

Let's add to our dataset the following row with said information:

Name: "Daenerys Stormborn of the House Targaryen, First of Her Name de ella, the Unburnt, Queen of the Andals and the First Men, Khaleesi of the Great Grass Sea, Breaker of Chains, and Mother of Dragons"

Amount: 100
Year: 2011

In [ ]:
new_name = {
    'name': 'Daenerys Stormborn of the House Targaryen, First of Her Name de ella, the Unburnt, Queen of the Andals and the First Men, Khaleesi of the Great Grass Sea, Breaker of Chains, and Mother of Dragons',
    'amount': 100,
    'year': 2011
}

df_names = df_names.append(new_name, ignore_index=True)
df_names

                                                     name  amount  year
0                                                Benjamin    2986  2010
1                                                   Sofia    2252  2010
2                                                Bautista    2176  2010
3                                                 Joaquín    2111  2010
4                                            Juan Ignacio    2039  2010
...                                                   ...     ...   ...
871490                             Isaias Sebastian Ariel       1  2014
871491                                   Yanira Valentina       1  2014
871492                                       Angie Ainara       1  2014
871493                                     Elias Hernando       1  2014
871494  Daenerys Stormborn of the House Targaryen, Fir...     100  2011

[871495 rows x 3 columns]

**TODO:** Investigate the columns and index functions. What do they do? What data type is their output? What known data type do they resemble?

In [ ]:
df_names.columns

Index(['name', 'amount', 'year'], dtype='object')

In [ ]:
df_names.index

RangeIndex(start=0, stop=871495, step=1)

**TODO:** What do the following operations do

In [ ]:
df_names['name']

0                                                  Benjamin
1                                                     Sofia
2                                                  Bautista
3                                                   Joaquín
4                                              Juan Ignacio
                                ...
871490                               Isaias Sebastian Ariel
871491                                     Yanira Valentina
871492                                         Angie Ainara
871493                                       Elias Hernando
871494    Daenerys Stormborn of the House Targaryen, Fir...
Name: name, Length: 871495, dtype: object

In [ ]:
df_names[['name', 'year']]

                                                     name  year
0                                                Benjamin  2010
1                                                   Sofia  2010
2                                                Bautista  2010
3                                                 Joaquín  2010
4                                            Juan Ignacio  2010
...                                                   ...   ...
871490                             Isaias Sebastian Ariel  2014
871491                                   Yanira Valentina  2014
871492                                       Angie Ainara  2014
871493                                     Elias Hernando  2014
871494  Daenerys Stormborn of the House Targaryen, Fir...  2011

[871495 rows x 2 columns]

In [ ]:
df_names.amount

0         2986
1         2252
2         2176
3         2111
4         2039
          ...
871490       1
871491       1
871492       1
871493       1
871494     100
Name: amount, Length: 871495, dtype: int64

In [ ]:
df_names['amount']

0         2986
1         2252
2         2176
3         2111
4         2039
          ...
871490       1
871491       1
871492       1
871493       1
871494     100
Name: amount, Length: 871495, dtype: int64

In [ ]:
'name' in df_names

True

**TODO:** Add a column to the dataframe that corresponds to the number of characters in each name

## Add a new column

In [ ]:
df_names['amount_chars'] = df_names['name'].str.len()
df_names

,name,amount,year,amount_chars
0,Benjamin,2986,2010,8
1,Sofia,2252,2010,5
2,Bautista,2176,2010,8
3,Joaquín,2111,2010,7
4,Juan Ignacio,2039,2010,12
...,...,...,...,...
871490,Isaias Sebastian Ariel,1,2014,22
871491,Yanira Valentina,1,2014,16
871492,Angie Ainara,1,2014,12
871493,Elias Hernando,1,2014,14
871494,"Daenerys Stormborn of the House Targaryen, Fir...",100,2011,195

## Filtering by mask

Its implementation is very similar in both NumPy and Pandas, so we will see how to do it first in NumPy then in Pandas.

Suppose we make 100 rolls of a die, but we want to select only those rolls that were greater than four. How can we do it?

In [ ]:
import numpy as np

In [ ]:
dice = np.random.randint(1, 7, size=100)
print(dice)

[2 6 1 4 2 3 1 3 4 3 1 6 6 5 3 6 5 6 1 6 1 6 2 5 2 3 6 2 1 5 2 1 5 1 2 4 1
 5 3 4 1 2 6 1 4 4 2 6 5 2 5 2 4 6 1 2 2 3 5 1 2 1 4 6 1 5 1 6 2 1 5 1 4 4
 5 1 6 5 4 3 4 5 5 1 2 5 3 5 1 5 4 3 6 6 6 1 3 3 6 4]

What we can do is create a mask:

In [ ]:
mask = dice > 3
print(mask)
print(type(mask))

[False  True False  True False False False False  True False False  True
  True  True False  True  True  True False  True False  True False  True
 False False  True False False  True False False  True False False  True
 False  True False  True False False  True False  True  True False  True
  True False  True False  True  True False False False False  True False
 False False  True  True False  True False  True False False  True False
  True  True  True False  True  True  True False  True  True  True False
 False  True False  True False  True  True False  True  True  True False
 False False  True  True]
<class 'numpy.ndarray'>

In [ ]:
print(dice[mask])

[6 4 4 6 6 5 6 5 6 6 6 5 6 5 5 4 5 4 6 4 4 6 5 5 4 6 5 4 6 5 6 5 4 4 5 6 5
 4 4 5 5 5 5 5 4 6 6 6 6 4]

In [ ]:
print(dice.sum())

344

In [ ]:
print(dice[dice > 3])

[6 4 4 6 6 5 6 5 6 6 6 5 6 5 5 4 5 4 6 4 4 6 5 5 4 6 5 4 6 5 6 5 4 4 5 6 5
 4 4 5 5 5 5 5 4 6 6 6 6 4]

**TODO:** Going back to our dataset, suppose we want to keep those names that were repeated more than 2000 times

In [ ]:
# To complete
mask = df_names["amount"]>2000
print("Names repeated more than 2000 times:\n",df_names[mask],"\n",sep="")
print("Count of names repeated more than 2000 times:\n",df_names[mask].count(),sep="")

Names repeated more than 2000 times:
                   name  amount  year  amount_chars
0              Benjamin    2986  2010             8
1                 Sofia    2252  2010             5
2              Bautista    2176  2010             8
3               Joaquín    2111  2010             7
4          Juan Ignacio    2039  2010            12
5               Martina    2026  2010             7
6              Santiago    2012  2010             8
135000         Benjamin    2535  2011             8
254431         Benjamin    4724  2012             8
254432         Isabella    3392  2012             8
254433          Joaquin    3138  2012             7
254434          Martina    3130  2012             7
254435            Sofía    3024  2012             5
254436         Catalina    3017  2012             8
254437         Bautista    3009  2012             8
254438          Santino    2929  2012             7
254439     Juan Ignacio    2632  2012            12
254440        Valentina    2564  2012             9
254441        Valentino    2514  2012             9
254442           Felipe    2513  2012             6
254443         Santiago    2457  2012             8
254444            Mateo    2319  2012             5
254445          Delfina    2251  2012             7
254446             Emma    2008  2012             4
457917         Benjamin    4960  2013             8
457918         Isabella    3587  2013             8
457919          Martina    3532  2013             7
457920          Santino    3215  2013             7
457921         Catalina    2934  2013             8
457922         Bautista    2831  2013             8
457923            Sofia    2735  2013             5
457924          Joaquin    2636  2013             7
457925            Mateo    2587  2013             5
457926        Francisco    2455  2013             9
457927       Valentina     2450  2013            10
457928           Felipe    2404  2013             6
457929        Valentino    2298  2013             9
457930     Juan Ignacio    2198  2013            12
457931  Thiago Benjamin    2107  2013            15
457932             Emma    2063  2013             4
457933         Santiago    2049  2013             8
457934          Delfina    2036  2013             7
662387         Benjamin    4286  2014             8
662388          Martina    3563  2014             7
662389         Isabella    3546  2014             8
662390         Catalina    2868  2014             8
662391         Bautista    2820  2014             8
662392            Sofia    2805  2014             5
662393        Valentino    2702  2014             9
662394           Felipe    2684  2014             6
662395          Joaquin    2607  2014             7
662396             Emma    2600  2014             4
662397          Santino    2516  2014             7
662398        Valentina    2432  2014             9
662399            Mateo    2402  2014             5
662400          Delfina    2285  2014             7
662401     Juan Ignacio    2260  2014            12
662402           Olivia    2213  2014             6
662403        Francisco    2140  2014             9
662404           Emilia    2075  2014             6

Count of names repeated more than 2000 times:
name            60
amount          60
year            60
amount_chars    60
dtype: int64

**TODO:** What if we want to select those names with more than 8 letters and from 2010 onwards?

In [ ]:
# To complete
df_names["year"] = pd.to_datetime(df_names["year"], format="%Y")
mask2 = (df_names['amount_chars']>8)
mask3 = (df_names["year"] > pd.to_datetime(2010, format="%Y"))
print(df_names[mask2][mask3])
print(df_names[mask2][mask3].count())

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:5: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """

                                                     name  amount       year  \
135008                                       Juan Ignacio    1514 2011-01-01
135009                                          Valentina    1502 2011-01-01
135013                                          Valentino    1381 2011-01-01
135018                                          Francisco    1100 2011-01-01
135024                                    Thiago Benjamin     925 2011-01-01
...                                                   ...     ...        ...
871490                             Isaias Sebastian Ariel       1 2014-01-01
871491                                   Yanira Valentina       1 2014-01-01
871492                                       Angie Ainara       1 2014-01-01
871493                                     Elias Hernando       1 2014-01-01
871494  Daenerys Stormborn of the House Targaryen, Fir...     100 2011-01-01

        amount_chars
135008            12
135009             9
135013             9
135018             9
135024            15
...              ...
871490            22
871491            16
871492            12
871493            14
871494           195

[717274 rows x 4 columns]

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:6: UserWarning: Boolean Series key will be reindexed to match DataFrame index.

name            717274
amount          717274
year            717274
amount_chars    717274
dtype: int64